Repository: marberts/gpindex
Catalog: po/R-*.po
Languages: fr

source: 'p', 'q', 'period', and 'product' must be the same length
fr: 'p', 'q', 'period' et 'product' doivent avoir la même longueur

source: 'window' must be greater than or equal to 2
fr: 'window' doit être supérieur ou égal à 2

source: 'window' must be less than or equal to the number of levels in 'period'
fr: 'window' doit être inférieur ou égal au nombre de niveaux dans 'period'

source: 'n' must be greater than or equal to 1
fr: 'n' doit être supérieur ou égal à 1

source: 'n' must be less than or equal to 'window' minus 1
fr: 'n' doit être inférieur ou égal à 'window' moins 1

source: there are duplicated period-product pairs
fr: il existe des paires période-produit en double

source: 'r' must be a finite length 1 numeric
fr: 'r' doit être un nombre fini de longueur 1

source: 'r' is very small in absolute value, but not zero; this can give misleading results
fr: 'r' est très petit en valeur absolue, mais pas nul; cela peut donner des résultats trompeurs

source: 'x' and 'w' must be the same length
fr: 'x' et 'w' doivent avoir la même longueur

source: 's' must be a finite length 1 numeric
fr: 's' doit être un nombre fini de longueur 1

source: 's' is very small in absolute value, but not zero; this can give misleading results
fr: 's' est très petit en valeur absolue, mais pas nul; cela peut donner des résultats trompeurs

source: 'r' and 's' are very close in value, but not equal; this can give misleading results
fr: 'r' et 's' ont des valeurs très proches, mais pas égales; cela peut donner des résultats trompeurs

source: 'r2' must be a pair of numeric values
fr: 'r2' doit être une paire de valeurs numériques

source: 't' must be a pair of numeric values
fr: 't' doit être une paire de valeurs numériques

source: 'period' and 'product' must be the same length
fr: 'period' et 'product' doivent avoir la même longueur

source: back_price()/base_price() are deprecated; use back_period()/base_period() instead
fr: back_price()/base_price() est obsolète; utilisez back_period()/base_period() à la place

source: all arguments must be the same length
fr: tous les arguments doivent avoir la même longueur

source: 'f' already has an argument called 'group'
fr: 'f' a déjà un argument appelé 'group'

source: 'group' has no levels to group by
fr: 'group' n'a pas de niveaux pour regrouper par

source: 'a' must be a finite length 1 numeric
fr: 'a' doit être un nombre fini de longueur 1

source: 'b' must be a finite length 1 numeric
fr: 'b' doit être un nombre fini de longueur 1
